import styles from './termsAndConditionsStyles.module.css';

const TermsAndConditions = () => {
    return (
        <div className={styles.policyPage}>
            <a className={styles.goHomeLink}
               href={'/'}
            >
                ← На головну
            </a>
            <div className={styles.policyBlock}>
                <h3 className={styles.title}>
                    Вступ
                </h3>
                <p className={styles.text}>
                    Ваша конфіденційність важлива для нас. Ці умови та політика конфіденційності пояснює, як ми
                    обробляємо вашу
                    інформацію, описує правила користування даним сервісом та інформує про відповідальність.
                    Використовуючи наші послуги, ви погоджуєтесь
                    з умовами та політикою.
                </p>
            </div>
            <div className={styles.policyBlock}>
                <h3 className={styles.title}>
                    Збір інформації
                </h3>
                <p className={styles.text}>
                    Ми не зберігаємо жодної інформації про користувачів після завершення сесії.
                    Інформація
                    яку ви вносите в форму, використовуєтсья тільки в цілях пошуку відповідного співрозмовника.
                </p>
            </div>
            <div className={styles.policyBlock}>
                <h3 className={styles.title}>
                    Безпека даних
                </h3>
                <p className={styles.text}>
                    Ми серйозно ставимося до вашої безпеки та використовуємо стандартні галузеві заходи для захисту
                    ваших даних. Однак жодна система не є на 100% безпечною, і ми не можемо гарантувати абсолютну
                    безпеку.
                    Ми рекомендуємо не ділитися жодною персональною інформацією при користуванні нашим сервісом, і
                    сповіщаємо що користувач несе повну відповідальність за інформацію яку поширює на нашому сервісі.
                </p>
            </div>
            <div className={styles.policyBlock}>
                <h3 className={styles.title}>
                    Правила спілкування в чаті
                </h3>
                <p className={styles.text}>
                    Ми прагнемо створити безпечний і доброзичливий простір для всіх користувачів. Тому під час
                    спілкування в чаті заборонено.

                </p>
                <p className={styles.text}>
                    - Поширювати матеріали які можеть принижувати честь та гідність інших
                    осіб.
                </p>
                <p className={styles.text}>
                    - Поширювати мову ворожнечі, дискримінаційні висловлювання чи заклики до насильства за будь-якою
                    ознакою.
                </p>
                <p className={styles.text}>
                    - Використовувати образливі чи принизливі висловлювання.
                </p>
                <p className={styles.text}>
                    - Здійснювати переслідування, погрози чи будь-які інші форми агресивної поведінки.
                </p>
            </div>
            <div className={styles.policyBlock}>
                <h3 className={styles.title}>
                    Обмеження
                </h3>
                <p className={styles.text}>
                    Наш сервіс призначений для користувачів старше 16 років. Погоджуючись із цими умовами ви
                    підтверджуєте що ваш вік досяг вищевказаного, і несете відповідальність за неправдиву інформацію
                    надану при заповненні форми.
                </p>
            </div>
        </div>
    );
}

export default TermsAndConditions;
